angola_notebook/part_12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-27 Sat 17:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notebook of a Return to My Native Land - part 12</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Notebook of a Return to My Native Land - part 12</h1>
<p>
<a href="index.html">Back to chapter index.</a>
</p>

<p>
Saturday, February 10, 2007
</p>

<div id="outline-container-orgf9505e1" class="outline-2">
<h2 id="orgf9505e1">Luanda, Again</h2>
<div class="outline-text-2" id="text-orgf9505e1">
<p>
Our return from Benguela to Luanda was planned to be fairly painless,
even potentially pleasant: we decided to fly back. There had been just
too many travelling adventures to recount and we needed just a little
bit of easiness, just that little bit of quietness for a
change. However, this being Angola, flying was not entirely
straightforward. We had spoken to Teresa, who convinced us not to buy
a ticket beforehand. Recalling some of her experiences, she told us
that at one time she had bought three plane tickets for a single
flight - no refunds given, of course. Best to go to the airport
without a ticket and buy one there and then, she suggested. This we
did. Although candongueiro routes didn't seem to service the airport,
it was easy enough to get there via taxi. When we arrived, we were
immediately asked whether we had a ticket or not. We didn't. From that
point onwards, the attendant started behaving in a shady sort of way,
looking both ways before talking and speaking really low. Actually,
everyone in the small airport suddenly seemed to act in a fishy way,
like they were all in a secret we didn't know. The chap told us not to
buy a ticket, and to stay in the empty waiting room till further
notice. After a while he showed up again, said there was a potential
flight, possibly via Lubango. Were we interested? If yes, he had to
part with 230 USD. Unfortunately we didn't have any change, something
he quickly picked up on, and somehow he managed to convince us he
deserved the extra 20 bucks for the effort of sorting it all
out. Within seconds the attendant was gone and, with him, our 250
bucks. Yet another of those cartoon moments - you know, like when Bugs
Bunny cons Elmer Fudd into doing something really, really silly, and a
couple of donkey ears appear on his head before he realises the
mistake. Those kind of moments. There you are, no attendant, no ticket
and no money. It was hard to explain just exactly at which point did
it seem like a good idea to give a total stranger a wad of cash and
trust his goodwill. Oh well, now there was nothing else to do other
than wait, so we waited and prayed for his safe return. Meanwhile a
small plane landed. Eventually, our contact returned. He had spoken to
the pilots, and there was now a direct flight to Luanda and we were on
it; all we had to do is wait for the DEFA registration, and then board
the plane. A little while longer, another half-an-hour or so, the DEFA
person called us to fill in the paperwork. Whenever you do an internal
flight in Angola you need to fill in some information like your
passport details, where you're staying, and so on. Perhaps some
remnants of the old, control-freak communist system. Once this was
done, we waited some more. Some additional people got into the waiting
room. Soon the pilots came round and called us for boarding. We all
boarded a really small plane, seventeen seats in total, ten or twelve
of them filled. And that was it, we were on our way to Luanda. As we
were flying, some aspects of the process became clear. No tickets were
ever issued. Our presence totally evaded the airline's ticketing
system, and the money got paid directly to our attendant and the
pilots. Thank God the plane didn't crash or otherwise no one would
have ever known our whereabouts. On the positive side, the flight was
excellent. We had never flown on a small aeroplane before but it was a
great experience. You can see everything, and feel a lot closer to the
sky as if you're skydiving or something. The sights were stunning.
</p>

<p>
When we got closer to Luanda, we started to see the effects of the
rains. Estadio dos Coqueiros was completely flooded, and looked like a
giant swimming pool. Most musseques were flooded too. There was water
everywhere. We had missed the first real rains in Luanda, the rains
that Elsa dreaded so much.
</p>
</div>
