angola_notebook/part_12.org
** DEFA

One thing we haven't mentioned much is the VISA renewal process. Don't
be fooled into thinking that it hasn't kept us busy - quite the
contrary. On hindsight, almost ever since we got into the country we
have been doing something related to the VISA; when we weren't
actually physically going to places, we had to at least ring people or
pray for things to get done soon. But lets go back in time, to last
December. We first went in to DEFA to figure out the exact
requirements and buy the forms. We were then told by a contact that we
needed a letter signed by notary stating that someone was taking
responsibility for us, and the photocopy of this person's ID card. Our
cousin Rosa kindly sorted this out for us, but the entire process of
getting the forms, filling them in, writing the letter, getting the
notary to sign it and photocopying the ID card took over three
weeks. There was even a point when we almost despaired, we only
noticed the letter had the wrong date on it after the notary had
already authenticated the signature, but since we didn't have enough
time to get a new one, we had to go with it as it was. Just before we
boarded the plane to Benguela, a mere three days before our VISAs
expired, we managed to hand in the forms and our passports. In return
we received a receipt, and were told that it had the same legal value
of our passports whilst we were on Angolan soil - best not lose it if
we wanted to avoid prison. There wasn't a date for the completion of
the process and it wasn't unheard of it taking months. We asked
around, and people thought we should be able to go on internal flights
with the receipt, but no one was entirely sure. This helped us on our
decision of going by bus to Benguela. In fact, we only found out for
sure when we boarded the plane back from Benguela; the receipt does
work fine. When we returned two weeks later, we were told the
passports were not ready yet. We wanted to go to Namibe as quickly as
possible, but we also wanted to have the passports with us, so we
decided to wait around a bit more. Turns out this was a very inspired
decision. We were told by a contact to go to DEFA a few days
later. After some haphazard queueing and loitering round, more than
six hours in total, we finally managed to get our passports back. It
had taken more than six weeks since we first asked about it till we
got our passports back, and it was one of the fastest VISA renewals on
record. We were extremely happy to see our passports safe and sound,
but, in the happiness of the moment, I had forgotten to check DEFA's
work. Shahin however, being the usual stickler for perfection, did
check it and she was not at all happy about it. The dates on the VISA
were wrong, by precisely one day. They had given us thirty days from
the date we requested the renewal, not the date of the last VISA. This
would make perfect sense if there was an organised department to tell
you the exact rules for the renewal process and to discuss things with
you, things like whether the date of your flight out was compatible
with the VISA expiration date or not. This being Angola, there is
obviously no such thing - you're expected to know it all. If you
didn't, well, that's your problem. We contemplated going back to DEFA
and complaining, but after all the trouble we had renewing the VISA -
and after being told a few times that we were extremely lucky for the
fast speed at which things were happening - well, it just seemed
obvious we had to avoid these people at all costs. The only other
alternative was to change the outgoing flights, a much more feasible
alternative.

It was at this point when we finally understood why everyone hates the
rains so much.

When we went to TAAG (the Angolan Airlines) we were told that the
computer systems were down, so there wasn't anything they could
do. What they failed to tell us, and we found out later on, was that
the systems had been down for the best part of a week, with no relief
in sight. We spent the entire day waiting, but the system never
returned. Unfortunately, the following day was a bank holiday,
Luanda's 431st birthday, so everything was closed. Friday became the
D-Day.

The day started with an early trip to TAAG, but the systems were still
down. Still praying that this was some kind of a temporary blip,
something that would get fixed during the day, we decided to walk down
the road to Western Union to get some money out. Unfortunately, their
systems were down too. Whilst we waited at a local cafe, re-hydrating
ourselves, Shahin managed to somehow swallow a fly. A dirty, Luandan
fly. The whole scene was out of a sitcom, except it really
happened. Fortunately, she didn't even puke. We laughed so much that
we were stared at by all who were in the cafe as we had streams of
tears rolling down our faces.

We returned to Western Union, but the systems were still down, so we
decided to go back to TAAG. The systems were not working there either,
and time was fast running out but there just wasn't anything we could
do so we went for lunch at Nando's. On our return to Western Union,
the queue had doubled in size since we last came, but the good news
was that the system was back up. Whilst in the queue I met Joao Solha,
a mate from high-school I hadn't seen in years. After the usual hugs
and reminisces, Joao told us that Western Union had been down for more
than a week, and he was fast running out of money. Today things were
pretty desperate. While we were chatting, news filtered out that the
system was back up, for the great relief of the massive crowds sitting
outside the bank. However, it was almost three o'clock - the usual
closing time - and there were tonnes of people waiting to be seen. The
system could go down at any time, Joao guaranteed us, like it had
happened earlier on in the week. It was up for an hour or two, but it
went down and hadn't returned since then. As we queued up and chatted,
we noticed that the queue wasn't actually moving. Shahin went on a
scouting mission and found out that the ordered queue we had joined in
an hour ago had now evolved to the dreaded Angolan queue. Angolan
queues are the worst type of queues. They basically grow from the
sides. For the more technically oriented, its a mix between a LIFO
(Last In First Out) and a Priority Queue - the priority algorithm
being how well you know the security guard at the door or the people
in front of you. We all got a bit upset with all this, Shahin in
particular, and decided to take action and join the front via the
sides too. Everybody else was doing it too, so when in Rome... This
went on for a while, with lots of pushing and shoving and shouting,
until the security guard decided he had had enough:

- "Either you start forming a real queue, or no one gets in!!".

We had been in many Angolan queues before and heard the same thing
before too, so we knew nothing - not a thing - would change,
regardless of the best intentions of the security chap. And so it was
this time too. All the people closer to the wall started shouting that
there was a real queue indeed, there had been one all along and they
were in it - which was true for the most part, but not entirely. The
new joiners in the middle of the sidewalk also started shouting,
claiming they were the real queue and always had been, and that there
was no need for further organisation. The shouting match went on for a
bit, with some people starting to get really agitated - including
Shahin - up to a point where the security guard had enough. You have
to put things in perspective. This was a Friday, after a week long
without any access to money. Everyone was really desperate. To this
environment, a keg of powder waiting to ignite, the security guard
decides to shout:

- "OK, I've had enough! You're not willing to organise this mess?! I
  don't care! You can all get in!"

There was a second or two of silence, the quiet before the storm. What
followed was one of the worse stampedes I've seen in my life, much
worse than the previous one in the same location a few weeks ago. The
really narrow door got attacked simultaneously by all sides with
untamed force. I don't know how the metal frame and the glass survived
it. Shahin was well in the thick of it, pushing, shouting,
waving. Apparently - I wasn't close enough to the front to see this -
there was a skinny lady that managed to get stuck to the door, and
everyone was going past her. Shahin had to push her into the branch,
probably saving her life. It was like a gold rush, except the money we
were getting was actually ours to start off with. Once the confusion
settled and everyone made their way in, we were told by the bank staff
that there was no reason to fear: everyone inside the branch was going
to get their turn - and here's the key part - provided the system was
up. We put the forms into the in-tray and prayed. The Gods must have
pitied us since about two hours later it was our turn, and we managed
to get our money. We heard later that Joao also managed to finally
access his cash, although he ended up taking a five hour lunch break
to get it. Once we had the cash in our hands, we ran back from Mutamba
to TAAG, all the while hoping that their system was working too and
didn't crash in the mean time. TAAG was in full effect when we got
there, a pretty agitated place, a rave party of a travel
agency. Somehow, I don't know how really, we managed to get a ticket
that was fairly close to the front of the queue. Half-an-hour later we
were seen by the attendant. After the usual moaning and feet-dragging,
the I'm-not-really-supposed-to-be-doing-this part, she actually
managed to change the ticket to one day before our VISA expiration.

This was one of the most tiring days we've ever experienced. When we
got back home we were simultaneously high, from the success, but also
really low from the tiredness. We had woken up at 7 o'clock to get to
TAAG and got back home more than twelve hours later, exhausted.

