angola_notebook/part_12.org
** The road to Namibe - or should I say Lubango

All the exhaustion and stress had some really negative
consequences. Shahin suddenly got a fever, very similar to the one I
had experienced before. We did the usual tests at the usual doctors
who, as usual, tried to help themselves of our hard earned cash - but
this time they even suggested having a 50 USD X-ray when Shahin said
she had a bit of a cough. That was the straw that broke the camel's
back. Even I, the least money conscious person in the whole world, had
just about enough of their daylight robbery. We decided to do a bit of
mix-and-match with the exams, play doctors if you'd like, and choose
for ourselves which exams she really needed to do. This had the
desired effect, because the doctor didn't shout at us went we went
back in to the room. We even had to ask him about three or for times
how to read the results, jumping on him in the hospital corridors, and
he must have felt sorry for us since he did explain it, somewhat. In
the end, it seemed like Shahin also had malaria, although not as
severe as mine. We bought the medication and followed the
treatment. However, we were now desperate to leave Luanda again and
this meant no rest for the wicked.

We made our way to the airport on the day of the next available
flight - as usual not reserving the tickets beforehand. Shahin was
pretty exhausted and ill-looking, a very worrying situation. Our
contact at the airport was going to sort it all out. We got there
early enough, ten o'clock in the morning, but Luanda's domestic
airport proved to be a lot more confusing than the international
one. Our contact told us that there shouldn't be any problems, all we
had to do is wait around to buy the ticket and then for check-in. So
we waited. An hour went by. Shahin progressively got worse, getting
warmer. Another half-hour went by. At this point, I heard through the
speaker's system - yes, they do seem to have one - something along the
lines of "Namibe's flight has been cancelled!". I couldn't hear
properly, and the warning wasn't issued that many times so we couldn't
tell for sure. If the flight had indeed been cancelled we would have
to get a cab back home and try again in a couple of days. That meant
two days less of holidays outside of Luanda, and two more days of pain
in the middle of the capital's confusion. The only other alternative
was to get a flight - any flight - to another province and make our
way to Namibe overland. This is less of a crazy idea than it sounds,
and people actually do it quite frequently due to the unpredictable
nature of Angolan flights. I mentioned this to our contact, who I had
to keep chasing for information, and he said he could get us to
Lubango - provided we were ready NOW. As in, right now, run to the
check-in desk. This with Shahin dying by my side, feverish. I did as
much of the running as I could, but it was unavoidable, she had to do
some running around too. Somehow we managed to buy the tickets (this
time we had real tickets), check-in, find the right waiting lounge,
get on the bus and board the plane. It was really exhausting. Shahin
was holding on just about, so much so that the flight attendant asked
me if she was alright, a worried look on her face. The flight wasn't
particularly long, and we soon got to Lubango. There, we were told by
Rosa that, by some huge, not yet explained coincidence, a cousin of
ours was also getting to Lubango within the next few minutes and would
be driving to Namibe soon after. Another cartoon moment. After some
waiting, during which Shahin's state improved dramatically, we finally
met cousin Chico. He told us he'd be making his way in an hour or two,
but in the mean time we had to find our own way into town centre and
wait there for him. Fortunately for us, the people near the airport
were extremely nice. Not only did they make sure we got in the right
taxi, but they also kept their cafe open for Shahin while I was busy
hunting Chico down at the airport. We finally got into a taxi, but
this was a fixed route cab which didn't actually go all the way to
town. The young taxi driver took a liking to our English, having
studied in Namibia himself, and after chatting to us for a little
while he decided to take us to our destination for free. Not only
that, he even gave us a mini-tour of town, showing us the cheap
hostels and everything. We ended up giving him some 800 kwanzas, money
he reluctantly accepted. He dropped us off at the Grand Hotel, in one
of Lubango's main arteries.

Lubango is the capital of the Huila province. It seems like a really
nice town, and we really would have wanted to stay for a few days
there, but since Rosa had already arranged for our transfer and since
Shahin wasn't feeling that great still, we thought best to go to
Namibe and return when possible. Lubango was once an important
agricultural centre, and also had a few key factories such as
Coca-Cola and Cuca, one of the Angolan beers. It still is a fairly
important place, Angola's city with the highest number of Portuguese
people. These two factories are alive and well, as is the cattle
industry. The national university has a couple of campuses there. Its
a big city as far as these things go, about the same size of Benguela,
if not bigger, and seems like a pretty lively place. Because its
further into the interior, Lubango is very green and lush. To our
great regret, we never did manage to return there.

Our stay in Lubango was cut short by Chico's arrival at the hotel in
his massive jeep. He then drove us to Namibe, down Serra da
Leba. These mountains are well known to all Angolans, even to those in
the diaspora that never set foot in the country, because all parents
mention it whenever they reminisce about the land. When you're there
you can easily understand why. The mountains are huge,
magnificent. The drive is extremely impressive, and it even has
waterfalls in the background. On the way up, leaving town, one can see
the whole of Lubango from high above. Then, for a few kilometres one
traverses a plateau, with quite a few farms. After that, the descend
of Serra da Leba begins. It really is an amazing trip, a must do. As
one descends and reaches flatland again, the scenery becomes less and
less green, until one reaches the desert proper. The scenery then
looks like Namibia. Its a huge change, but its done really gradually
over hundreds of kilometres. In less than three hours we were in
Namibe, standing at my cousin's Milucha doorstep.

One honourable mention goes to the roads that link Lubango to
Namibe. These are the best roads we saw in the whole of Angola, so
good its impossible to describe in words. There were very few holes in
it, a veritable velvet of a surface.

