angola_notebook/part_12.org
** Paludismo Strikes Back, Hard

As we got to Namibe, Shahin's health improved dramatically. Perhaps
some of it has to do with the much less humid climate in Lubango and
Namibe, or with the needed rest we finally got. However, just as we
were celebrating her recovery, I started having a mild fever. It began
on our first outing in Namibe, in which Milucha took us to see town
and then to the nearby city of Tombwa. Late on that day I had a very
high fever. We couldn't manage to get the fever down, even after
taking medicine and having cold water showers. I ended up staying
outdoors in the yard with no t-shirt on, trying to cool down. This
worked for a bit, but eventually the fever came back. It was still
pretty high for most of the next morning so we decided to go to the
doctor. There, very swiftly, the Russian doctor determined I had
paludismo - malaria - again. He also took the time to explain which
exams we needed to figure out if we have malaria - Gota Espessa and
Hemograma - and explained that these exams are not affected by
profilaxia at all. He expressed the same extreme dislike for
profilaxia as every other doctor has in Angola. All and all, not only
was the service a lot better in Namibe, but the prices were more
reasonable. We spent around 50 bucks in total, and this includes the
doctor's time, all the medicine he prescribed and the nurse's time
too. Why would you need a nurse? Well, since my fever didn't want to
came down, the doctor determined I needed diperona
injections. Diperona is normally taken like paracetamol, in pill form,
and very much like it its used to bring the fever down. It is also
available in liquid form, for the more severe cases, but this requires
injecting it into the patient. To be more precise, into the patient's
bum. Not only did I have to be subjected to this humiliation, but it
also hurt like taking back teeth out without anaesthetics. To make
matters worse, diperona was mixed with something else, some kind of
anti-allergenic drug, and the end result was it knocked me out,
hard. After an injection, all I could muster was to get home groggy,
find my bed and sleep. The doctor wanted me to take these injections
for 3 days, twice a day, but we were keen on getting off of it as soon
as possible. In the end, I had three injections, by which time my body
temperature was normal. My bum, however, never quite recovered from
it, and I still walk funny. Around four days later I felt a lot better
and was well enough to start leaving the house - that is, for reasons
other than going to the clinic for injections. And so it was that our
one week stay in Namibe was taken mostly by paludismo.

** Namibe

Namibe is actually quite a nice town, and it is a fairly emotional
place for me since most of my family comes from here. It is situated
at the edge of the desert, and once upon a time it was Angola's
fishing district. It was also responsible for producing most of
Angola's olives. Nowadays, most employment in the province is still
fishing related, and many fisheries still function, but they are a bit
crippled. The government is trying to reform the industry, but its a
slow process.

Unfortunately, unlike Benguela, the candongueiro network is not
particularly efficient in Namibe. For instance, you can't go to the
nearby beaches without personal transportation. We were lucky that
Milucha was actually on holidays, and was willing to spend her time
showing us round. Even though we didn't have as much time as we would
have liked, we still got to see most of the city, including places
like my mom's primary and high-school, and my grandad's old house. It
was an incredible experience. We even had time to meet up with Lau and
Leonor, up from Luanda for the long weekend, also visiting relatives.

It was great to see the level of recent development in the
province. Most roads have been tarmacked recently, and there a few new
hospitals and schools, including a campus of the state
university. Clinics work really well, as we found out. There is also
some social housing. As the locals reminded us, there is still lots of
work to be done - for instance, electricity and water are still
haphazard - but, for such a small district, it sure seems to have
managed to get their act together.

After a week in Namibe, we returned to Luanda.

** Goodbye Angola

Our last few days in Angola went by pretty quickly. We just had enough
time to say goodbye to people and rest a bit. We had a goodbye dinner
at Chicala's Chinese restaurant, by now our favourite for both the
quality of the food and the price. We were hoping to get a nice crowd,
including Ica and the wife and Rui Murthala and his
woman. Unfortunately, everyone seemed to be tied up. The old faithfuls
Rosa as well as Lau and Leonor did not let us down. It was a great
dinner. Lau offered to take us early in the morning to the airport,
which was great since Macon taxi's were found to be a bit unreliable
on early pickups. We were still a bit concerned, worried that somehow
TAAG would mess-up the tickets and make us stay for an extra day,
getting into VISA problems. Nothing of the kind happened in the
end. Things went really smoothly and we even got to try the new
Boeings TAAG has bought, with multimedia players on each individual
desk. A few hours later we were back in Joburg.

| [[file:part_11.org][Back to previous chapter]] | [[file:index.org][Back to chapter index.]] | [[file:interlude.org][Forward to next chapter]] |
